i have tested terraform now able to create service account needed for Defender onboarding. 
```
terraform apply --auto-approve
data.google_compute_default_service_account.default: Reading...
data.google_compute_default_service_account.default: Read complete after 4s [id=projects/azure-arc-397704/serviceAccounts/363381270130-compute@developer.gserviceaccount.com]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:      

  # azurerm_resource_group.azure_rg will be created
  + resource "azurerm_resource_group" "azure_rg" { 
      + id       = (known after apply)
      + location = "westus2"
      + name     = "Arc-GCP-Demo"
    }

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" { 
      + can_ip_forward       = false
      + cpu_platform         = (known after apply) 
      + current_status       = (known after apply) 
      + deletion_protection  = false
      + guest_accelerator    = (known after apply) 
      + id                   = (known after apply) 
      + instance_id          = (known after apply) 
      + label_fingerprint    = (known after apply)
      + machine_type         = "g1-small"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                arcdemo:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDKwkgC9fFQtmVmmNagbIzfOjKKItgQx5zR/lq3eAwudiAV1NTUf138tcGLvSryO85gbBRT4DVLAIGDt7VE2dwOnAZzSrv8oeJm3wEWQ34yWOrO2WNoO9pCFWhtUTqkosi3t6KiVp2qthUTGK5gqMCZoutsGwF/6SbRq5+KJpVFZx62gzDomc3CscxNYRfQuv216tPaeG4E3MQ0TA414DnJHe+YElrvDARENzKsLKwkR5bO7ePpovcF8qHdbavFUFv8R/TNKaRFkY5JcBeTWc2jxBm7vwJ14jDnk/YzPM6VQDYEOTMVXOxoDZWnxwpSh8u5KZIlW/w/g9I/HYncjt2Neh82L5qdIP9dH13eJz8nHgRMYTzlLaFGvUbW6Dl97yybB7O7qOEwHQpcJW1KCGEhRHexur+wUK0jV6RhEJ2scBR2yRzcyN9/jhWEyBSBIObvAfTTQQkBTzSEAvpF7i8rQyiVHrVHNBoXH+k+pLTe57jXaqocIFw+OSGuYuj/jiesycTivwwRJoFy6nwaVPBWH04wwG5DOYOtCxc+jAw/Z8+iD98AuXifXv0A56BFJZ5V2988dx0sA1c5byft7nbdunpEepWgFxVxpN//qM/pDjEzHuDdraTqE3bbvvM4IFtqQz8CuukPqsFKnajnM1Ss0UU5l8TZQ90Y5cSl563Ebw== aditya@DESKTOP-I1FEB7T
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "arc-gcp-demo"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-west1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + service_account {
          + email  = "363381270130-compute@developer.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # local_file.install_arc_agent_sh will be created
  + resource "local_file" "install_arc_agent_sh" {
      + content              = <<-EOT
            #!/bin/bash

            # Download the installation package
            wget https://aka.ms/azcmagent -O ~/install_linux_azcmagent.sh

            # Install the hybrid agent
            sudo bash ~/install_linux_azcmagent.sh

            # Run connect command
            sudo azcmagent connect \
              --service-principal-id "ed1982b9-45dc-47d5-ab3c-6155468dc34d" \
              --service-principal-secret "BqU8Q~ZtgqgJHxu~ArIBDW1r31nadc8kEEPq5diM" \
              --tenant-id "0bed5dca-2730-4b14-a0a0-cbb5096d8484" \
              --subscription-id "30ec2138-bada-4436-b82c-7207f1e4ce86" \
              --location "westus2" \
              --resource-group "Arc-GCP-Demo" \
              --resource-name $HOSTNAME \
              --correlation-id "d009f5dd-dba8-4ac7-bac9-b54ef3a6671a"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "scripts/install_arc_agent.sh"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default_account = "363381270130-compute@developer.gserviceaccount.com"
  + ip              = (known after apply)
local_file.install_arc_agent_sh: Creating...
local_file.install_arc_agent_sh: Creation complete after 0s [id=d285dc68baea754792b20445192c86b1740530bc]
google_compute_instance.default: Creating...
azurerm_resource_group.azure_rg: Creating...
google_compute_instance.default: Still creating... [10s elapsed]
azurerm_resource_group.azure_rg: Creation complete after 5s [id=/subscriptions/30ec2138-bada-4436-b82c-7207f1e4ce86/resourceGroups/Arc-GCP-Demo]
google_compute_instance.default: Still creating... [20s elapsed]
google_compute_instance.default: Still creating... [30s elapsed]
google_compute_instance.default: Provisioning with 'file'...
google_compute_instance.default: Still creating... [40s elapsed]
google_compute_instance.default: Still creating... [50s elapsed]
google_compute_instance.default: Still creating... [1m0s elapsed]
google_compute_instance.default: Provisioning with 'remote-exec'...
google_compute_instance.default (remote-exec): Connecting to remote host via SSH...
google_compute_instance.default (remote-exec):   Host: 34.82.149.154
google_compute_instance.default (remote-exec):   User: arcdemo
google_compute_instance.default (remote-exec):   Password: false
google_compute_instance.default (remote-exec):   Private key: true
google_compute_instance.default (remote-exec):   Certificate: false
google_compute_instance.default (remote-exec):   SSH Agent: false
google_compute_instance.default (remote-exec):   Checking Host Key: false
google_compute_instance.default (remote-exec):   Target Platform: unix
google_compute_instance.default (remote-exec): Connected!
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 100%
google_compute_instance.default (remote-exec): Reading package lists... Done
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... Done
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... Done
google_compute_instance.default (remote-exec): E: Unable to locate package python-ctypes
google_compute_instance.default (remote-exec): --2023-09-23 11:42:21--  https://aka.ms/azcmagent
google_compute_instance.default (remote-exec): Resolving aka.ms (aka.ms)... 104.99.50.122
google_compute_instance.default (remote-exec): Connecting to aka.ms (aka.ms)|104.99.50.122|:443... connected.
google_compute_instance.default (remote-exec): HTTP request sent, awaiting response... 301 Moved Permanently
google_compute_instance.default (remote-exec): Location: https://gbl.his.arc.azure.com/installationScripts?api-version=1.0-preview&platform=linux [following]
google_compute_instance.default (remote-exec): --2023-09-23 11:42:21--  https://gbl.his.arc.azure.com/installationScripts?api-version=1.0-preview&platform=linux
google_compute_instance.default (remote-exec): Resolving gbl.his.arc.azure.com (gbl.his.arc.azure.com)... 40.64.132.84
google_compute_instance.default (remote-exec): Connecting to gbl.his.arc.azure.com (gbl.his.arc.azure.com)|40.64.132.84|:443... connected.
google_compute_instance.default (remote-exec): HTTP request sent, awaiting response... 200 OK
google_compute_instance.default (remote-exec): Length: unspecified [text/plain]
google_compute_instance.default (remote-exec): Saving to: ‘/root/install_linux_azcmagent.sh’

google_compute_instance.default (remote-exec):       /root/            0  --.-KB/s
google_compute_instance.default (remote-exec): /root/instal       25.01K  --.-KB/s    in 0.009s

google_compute_instance.default (remote-exec): 2023-09-23 11:42:21 (2.59 MB/s) - ‘/root/install_linux_azcmagent.sh’ saved [25614]

google_compute_instance.default (remote-exec): Using 'curl' for downloads
google_compute_instance.default (remote-exec): Total physical memory: 1692112 kB

google_compute_instance.default (remote-exec): Retrieving distro info from /etc/os-release...
google_compute_instance.default (remote-exec): Configuring for Ubuntu 22.04...
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): Hit:1 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy InRelease
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Connecting to security.ubuntu.com (
google_compute_instance.default (remote-exec): Get:2 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates InRelease [119 kB]
google_compute_instance.default (remote-exec): Get:3 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports InRelease [109 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Connecting to security.ubuntu.com (
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Waiting for headers]
google_compute_instance.default (remote-exec): Get:4 http://security.ubuntu.com/ubuntu jammy-security InRelease [110 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [4 InRelease 13.8 kB/110 kB 12%]
google_compute_instance.default (remote-exec): Get:5 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/universe amd64 Packages [14.1 MB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages 49.1 kB/14.1 MB 0%] [4 I
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [4 InRelease 78.5 kB/110 kB 71%]
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [Waiting for 
google_compute_instance.default (remote-exec): Get:6 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/universe Translation-en [5652 kB]
google_compute_instance.default: Still creating... [1m10s elapsed]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [6 Translatio
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [6 Translatio
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [6 Translatio
google_compute_instance.default (remote-exec): Get:7 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/universe amd64 c-n-f Metadata [286 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [7 Commands-a
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:8 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/multiverse amd64 Packages [217 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [8 Packages 0
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:9 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/multiverse Translation-en [112 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [9 Translatio
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:10 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy/multiverse amd64 c-n-f Metadata [8372 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [10 Commands-
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:11 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages [1012 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [11 Packages 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:12 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/main Translation-en [227 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [12 Translati
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:13 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/main amd64 c-n-f Metadata [15.6 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [13 Commands-
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:14 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/restricted amd64 Packages [898 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [14 Packages 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:15 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/restricted Translation-en [145 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [15 Translati
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:16 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages [984 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [16 Packages 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:17 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/universe Translation-en [215 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [17 Translati
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:18 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/universe amd64 c-n-f Metadata [21.8 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [18 Commands-
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:19 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/multiverse amd64 Packages [41.6 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [19 Packages 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:20 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/multiverse Translation-en [9768 B]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [20 Translati
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:21 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates/multiverse amd64 c-n-f Metadata [476 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [21 Commands-
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:22 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/main amd64 Packages [41.7 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [22 Packages 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:23 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/main Translation-en [10.5 kB]
google_compute_instance.default (remote-exec): Get:24 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/main amd64 c-n-f Metadata [388 B]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [Waiting for 
google_compute_instance.default (remote-exec): Get:25 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/restricted amd64 c-n-f Metadata [116 B]
google_compute_instance.default (remote-exec): Get:26 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/universe amd64 Packages [24.3 kB]
google_compute_instance.default (remote-exec): Get:27 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/universe Translation-en [16.4 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B] [27 Translati
google_compute_instance.default (remote-exec): Get:28 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/universe amd64 c-n-f Metadata [640 B]
google_compute_instance.default (remote-exec): Get:29 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports/multiverse amd64 c-n-f Metadata [116 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 83% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:30 http://security.ubuntu.com/ubuntu jammy-security/main amd64 Packages [802 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 83% [5 Packages store 0 B] [30 Packages
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 85% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): Get:31 http://security.ubuntu.com/ubuntu jammy-security/main Translation-en [169 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 85% [5 Packages store 0 B] [31 Translat
google_compute_instance.default (remote-exec): Get:32 http://security.ubuntu.com/ubuntu jammy-security/main amd64 c-n-f Metadata [11.3 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 86% [5 Packages store 0 B] [32 Commands
google_compute_instance.default (remote-exec): Get:33 http://security.ubuntu.com/ubuntu jammy-security/restricted amd64 Packages [882 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 86% [5 Packages store 0 B] [33 Packages
google_compute_instance.default (remote-exec): Get:34 http://security.ubuntu.com/ubuntu jammy-security/restricted Translation-en [142 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 88% [5 Packages store 0 B] [34 Translat
google_compute_instance.default (remote-exec): Get:35 http://security.ubuntu.com/ubuntu jammy-security/universe amd64 Packages [785 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 89% [5 Packages store 0 B] [35 Packages
google_compute_instance.default (remote-exec): Get:36 http://security.ubuntu.com/ubuntu jammy-security/universe Translation-en [143 kB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 91% [5 Packages store 0 B] [36 Translat
google_compute_instance.default (remote-exec): Get:37 http://security.ubuntu.com/ubuntu jammy-security/universe amd64 c-n-f Metadata [16.7 kB]
google_compute_instance.default (remote-exec): Get:38 http://security.ubuntu.com/ubuntu jammy-security/multiverse amd64 Packages [36.5 kB]
google_compute_instance.default (remote-exec):
google_compute_instance.default (remote-exec): 91% [5 Packages store 0 B] [38 Packages
google_compute_instance.default (remote-exec): Get:39 http://security.ubuntu.com/ubuntu jammy-security/multiverse Translation-en [7060 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 91% [5 Packages store 0 B] [Connecting 
google_compute_instance.default (remote-exec): Get:40 http://security.ubuntu.com/ubuntu jammy-security/multiverse amd64 c-n-f Metadata [260 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 91% [5 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 92% [Working]
google_compute_instance.default (remote-exec): 92% [6 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 92% [6 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 92% [Working]
google_compute_instance.default (remote-exec): 92% [7 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 92% [Working]
google_compute_instance.default (remote-exec): 92% [8 Packages store 0 B]
google_compute_instance.default (remote-exec): 92% [Working]
google_compute_instance.default (remote-exec): 92% [9 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 93% [Working]
google_compute_instance.default (remote-exec): 93% [10 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 93% [Working]
google_compute_instance.default (remote-exec): 93% [11 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 93% [Working]
google_compute_instance.default (remote-exec): 93% [12 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 93% [Working]
google_compute_instance.default (remote-exec): 93% [13 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 94% [Working]
google_compute_instance.default (remote-exec): 94% [14 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 94% [Working]
google_compute_instance.default (remote-exec): 94% [15 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 94% [Working]
google_compute_instance.default (remote-exec): 94% [16 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 94% [Working]
google_compute_instance.default (remote-exec): 94% [17 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 95% [Working]
google_compute_instance.default (remote-exec): 95% [18 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 95% [Working]
google_compute_instance.default (remote-exec): 95% [19 Packages store 0 B]
google_compute_instance.default (remote-exec): 95% [Working]
google_compute_instance.default (remote-exec): 95% [20 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 95% [Working]
google_compute_instance.default (remote-exec): 95% [21 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 95% [Working]
google_compute_instance.default (remote-exec): 95% [22 Packages store 0 B]
google_compute_instance.default (remote-exec): 96% [Working]
google_compute_instance.default (remote-exec): 96% [23 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 96% [Working]
google_compute_instance.default (remote-exec): 96% [24 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 96% [Working]
google_compute_instance.default (remote-exec): 96% [25 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 96% [Working]
google_compute_instance.default (remote-exec): 96% [26 Packages store 0 B]
google_compute_instance.default (remote-exec): 97% [Working]
google_compute_instance.default (remote-exec): 97% [27 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 97% [Working]
google_compute_instance.default (remote-exec): 97% [28 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 97% [Working]
google_compute_instance.default (remote-exec): 97% [29 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 97% [Working]
google_compute_instance.default (remote-exec): 97% [30 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 98% [Working]
google_compute_instance.default (remote-exec): 98% [31 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 98% [Working]
google_compute_instance.default (remote-exec): 98% [32 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 98% [Working]
google_compute_instance.default (remote-exec): 98% [33 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 98% [Working]
google_compute_instance.default (remote-exec): 98% [34 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 99% [Working]
google_compute_instance.default (remote-exec): 99% [35 Packages store 0 B]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 99% [Working]
google_compute_instance.default (remote-exec): 99% [36 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 99% [Working]
google_compute_instance.default (remote-exec): 99% [37 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 99% [Working]
google_compute_instance.default (remote-exec): 99% [38 Packages store 0 B]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): 100% [39 Translation-en store 0 B]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): 100% [40 Commands-amd64 store 0 B]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): Fetched 27.4 MB in 5s (5159 kB/s)
google_compute_instance.default: Still creating... [1m20s elapsed]
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 4%
google_compute_instance.default (remote-exec): Reading package lists... 4%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 7%
google_compute_instance.default (remote-exec): Reading package lists... 7%
google_compute_instance.default (remote-exec): Reading package lists... 48%
google_compute_instance.default (remote-exec): Reading package lists... 48%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 69%
google_compute_instance.default (remote-exec): Reading package lists... 69%
google_compute_instance.default (remote-exec): Reading package lists... 71%
google_compute_instance.default (remote-exec): Reading package lists... 72%
google_compute_instance.default (remote-exec): Reading package lists... 72%
google_compute_instance.default (remote-exec): Reading package lists... 74%
google_compute_instance.default (remote-exec): Reading package lists... 74%
google_compute_instance.default (remote-exec): Reading package lists... 78%
google_compute_instance.default (remote-exec): Reading package lists... 78%
google_compute_instance.default (remote-exec): Reading package lists... 79%
google_compute_instance.default (remote-exec): Reading package lists... 79%
google_compute_instance.default (remote-exec): Reading package lists... 83%
google_compute_instance.default (remote-exec): Reading package lists... 83%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 85%
google_compute_instance.default (remote-exec): Reading package lists... 88%
google_compute_instance.default (remote-exec): Reading package lists... 88%
google_compute_instance.default (remote-exec): Reading package lists... 89%
google_compute_instance.default (remote-exec): Reading package lists... 89%
google_compute_instance.default (remote-exec): Reading package lists... 93%
google_compute_instance.default (remote-exec): Reading package lists... 93%
google_compute_instance.default (remote-exec): Reading package lists... 95%
google_compute_instance.default (remote-exec): Reading package lists... 95%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... Done
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... Done
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... Done
google_compute_instance.default (remote-exec): 4 packages can be upgraded. Run 'apt list --upgradable' to see them.
google_compute_instance.default (remote-exec):   % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
google_compute_instance.default (remote-exec):                                  Dload  Upload   Total   Spent    Left  Speed
google_compute_instance.default (remote-exec):   0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
google_compute_instance.default (remote-exec): 100  3692  100  3692    0     0  16359      0 --:--:-- --:--:-- --:--:-- 16408
google_compute_instance.default (remote-exec): Selecting previously unselected package packages-microsoft-prod.
google_compute_instance.default (remote-exec): (Reading database ...
google_compute_instance.default (remote-exec): (Reading database ... 5%
google_compute_instance.default (remote-exec): (Reading database ... 10%
google_compute_instance.default (remote-exec): (Reading database ... 15%
google_compute_instance.default (remote-exec): (Reading database ... 20%
google_compute_instance.default (remote-exec): (Reading database ... 25%
google_compute_instance.default (remote-exec): (Reading database ... 30%
google_compute_instance.default (remote-exec): (Reading database ... 35%
google_compute_instance.default (remote-exec): (Reading database ... 40%
google_compute_instance.default (remote-exec): (Reading database ... 45%
google_compute_instance.default (remote-exec): (Reading database ... 50%
google_compute_instance.default (remote-exec): (Reading database ... 55%
google_compute_instance.default (remote-exec): (Reading database ... 60%
google_compute_instance.default (remote-exec): (Reading database ... 65%
google_compute_instance.default (remote-exec): (Reading database ... 70%
google_compute_instance.default (remote-exec): (Reading database ... 75%
google_compute_instance.default (remote-exec): (Reading database ... 80%
google_compute_instance.default (remote-exec): (Reading database ... 85%
google_compute_instance.default (remote-exec): (Reading database ... 90%
google_compute_instance.default (remote-exec): (Reading database ... 95%
google_compute_instance.default (remote-exec): (Reading database ... 100%
google_compute_instance.default (remote-exec): (Reading database ... 65435 files and directories currently installed.)
google_compute_instance.default (remote-exec): Preparing to unpack .../packages-microsoft-prod.deb ...
google_compute_instance.default (remote-exec): Unpacking packages-microsoft-prod (1.0-ubuntu22.04.1) ...
google_compute_instance.default (remote-exec): Setting up packages-microsoft-prod (1.0-ubuntu22.04.1) ...
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): Hit:1 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy InRelease
google_compute_instance.default (remote-exec): 0% [Connecting to security.ubuntu.com (
google_compute_instance.default (remote-exec): Hit:2 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-updates InRelease
google_compute_instance.default (remote-exec): Hit:3 http://us-west1.gce.archive.ubuntu.com/ubuntu jammy-backports InRelease
google_compute_instance.default (remote-exec): 0% [Connecting to security.ubuntu.com (
google_compute_instance.default (remote-exec): Hit:4 http://security.ubuntu.com/ubuntu jammy-security InRelease
google_compute_instance.default (remote-exec): 0% [Waiting for headers]
google_compute_instance.default (remote-exec): Get:5 https://packages.microsoft.com/ubuntu/22.04/prod jammy InRelease [3611 B]
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 21% [Working]
google_compute_instance.default (remote-exec): Get:6 https://packages.microsoft.com/ubuntu/22.04/prod jammy/main all Packages [970 B]
google_compute_instance.default (remote-exec): 22% [Working]
google_compute_instance.default (remote-exec): 22% [6 Packages store 0 B] [Waiting for
google_compute_instance.default (remote-exec): 22% [Waiting for headers]
google_compute_instance.default (remote-exec): Get:7 https://packages.microsoft.com/ubuntu/22.04/prod jammy/main arm64 Packages [26.5 kB]
google_compute_instance.default (remote-exec): 37% [Waiting for headers]
google_compute_instance.default (remote-exec): 37% [7 Packages store 0 B] [Waiting for
google_compute_instance.default (remote-exec): 37% [Waiting for headers]
google_compute_instance.default (remote-exec): Get:8 https://packages.microsoft.com/ubuntu/22.04/prod jammy/main amd64 Packages [102 kB]
google_compute_instance.default (remote-exec): 74% [8 Packages 65.2 kB/102 kB 64%]
google_compute_instance.default (remote-exec): 94% [Working]
google_compute_instance.default (remote-exec): Get:9 https://packages.microsoft.com/ubuntu/22.04/prod jammy/main armhf Packages [9463 B]
google_compute_instance.default (remote-exec): 94% [9 Packages 0 B/9463 B 0%]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): 100% [8 Packages store 0 B]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): 100% [9 Packages store 0 B]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): Fetched 143 kB in 1s (131 kB/s)
google_compute_instance.default: Still creating... [1m30s elapsed]
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 4%
google_compute_instance.default (remote-exec): Reading package lists... 4%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 6%
google_compute_instance.default (remote-exec): Reading package lists... 7%
google_compute_instance.default (remote-exec): Reading package lists... 7%
google_compute_instance.default (remote-exec): Reading package lists... 48%
google_compute_instance.default (remote-exec): Reading package lists... 48%
google_compute_instance.default (remote-exec): Reading package lists... 67%
google_compute_instance.default (remote-exec): Reading package lists... 67%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 68%
google_compute_instance.default (remote-exec): Reading package lists... 71%
google_compute_instance.default (remote-exec): Reading package lists... 72%
google_compute_instance.default (remote-exec): Reading package lists... 72%
google_compute_instance.default (remote-exec): Reading package lists... 74%
google_compute_instance.default (remote-exec): Reading package lists... 74%
google_compute_instance.default (remote-exec): Reading package lists... 77%
google_compute_instance.default (remote-exec): Reading package lists... 77%
google_compute_instance.default (remote-exec): Reading package lists... 79%
google_compute_instance.default (remote-exec): Reading package lists... 79%
google_compute_instance.default (remote-exec): Reading package lists... 83%
google_compute_instance.default (remote-exec): Reading package lists... 83%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 84%
google_compute_instance.default (remote-exec): Reading package lists... 87%
google_compute_instance.default (remote-exec): Reading package lists... 87%
google_compute_instance.default (remote-exec): Reading package lists... 89%
google_compute_instance.default (remote-exec): Reading package lists... 89%
google_compute_instance.default (remote-exec): Reading package lists... 92%
google_compute_instance.default (remote-exec): Reading package lists... 92%
google_compute_instance.default (remote-exec): Reading package lists... 94%
google_compute_instance.default (remote-exec): Reading package lists... 94%
google_compute_instance.default (remote-exec): Reading package lists... 97%
google_compute_instance.default (remote-exec): Reading package lists... 97%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 98%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... 99%
google_compute_instance.default (remote-exec): Reading package lists... Done
google_compute_instance.default (remote-exec): Reading package lists... 0%
google_compute_instance.default (remote-exec): Reading package lists... 100%
google_compute_instance.default (remote-exec): Reading package lists... Done
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 0%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... 50%
google_compute_instance.default (remote-exec): Building dependency tree... Done
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... 0%
google_compute_instance.default (remote-exec): Reading state information... Done
google_compute_instance.default (remote-exec): The following package was automatically installed and is no longer required:
google_compute_instance.default (remote-exec):   libnuma1
google_compute_instance.default (remote-exec): Use 'sudo apt autoremove' to remove it.
google_compute_instance.default (remote-exec): The following NEW packages will be installed:
google_compute_instance.default (remote-exec):   azcmagent
google_compute_instance.default (remote-exec): 0 upgraded, 1 newly installed, 0 to remove and 4 not upgraded.
google_compute_instance.default (remote-exec): Need to get 54.8 MB of archives.
google_compute_instance.default (remote-exec): After this operation, 0 B of additional disk space will be used.
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Working]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [Waiting for headers]
google_compute_instance.default (remote-exec): Get:1 https://packages.microsoft.com/ubuntu/22.04/prod jammy/main amd64 azcmagent amd64 1.34.02440.1130 [54.8 MB]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 0% [1 azcmagent 0 B/54.8 MB 0%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 5% [1 azcmagent 3620 kB/54.8 MB 7%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 29% [1 azcmagent 19.6 MB/54.8 MB 36%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 58% [1 azcmagent 39.9 MB/54.8 MB 73%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 80% [1 azcmagent 54.8 MB/54.8 MB 100%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 80% [1 azcmagent 54.8 MB/54.8 MB 100%]
google_compute_instance.default (remote-exec): 
google_compute_instance.default (remote-exec): 80% [1 azcmagent 54.8 MB/54.8 MB 100%]
google_compute_instance.default (remote-exec): 100% [Working]
google_compute_instance.default (remote-exec): Fetched 54.8 MB in 4s (15.0 MB/s)
                                               Selecting previously unselected package azcmagent.
google_compute_instance.default (remote-exec): (Reading database ...
google_compute_instance.default (remote-exec): (Reading database ... 5%
google_compute_instance.default (remote-exec): (Reading database ... 10%
google_compute_instance.default (remote-exec): (Reading database ... 15%
google_compute_instance.default (remote-exec): (Reading database ... 20%
google_compute_instance.default (remote-exec): (Reading database ... 25%
google_compute_instance.default (remote-exec): (Reading database ... 30%
google_compute_instance.default (remote-exec): (Reading database ... 35%
google_compute_instance.default (remote-exec): (Reading database ... 40%
google_compute_instance.default (remote-exec): (Reading database ... 45%
google_compute_instance.default (remote-exec): (Reading database ... 50%
google_compute_instance.default (remote-exec): (Reading database ... 55%
google_compute_instance.default (remote-exec): (Reading database ... 60%
google_compute_instance.default (remote-exec): (Reading database ... 65%
google_compute_instance.default (remote-exec): (Reading database ... 70%
google_compute_instance.default (remote-exec): (Reading database ... 75%
google_compute_instance.default (remote-exec): (Reading database ... 80%
google_compute_instance.default (remote-exec): (Reading database ... 85%
google_compute_instance.default (remote-exec): (Reading database ... 90%
google_compute_instance.default (remote-exec): (Reading database ... 95%
google_compute_instance.default (remote-exec): (Reading database ... 100%
google_compute_instance.default (remote-exec): (Reading database ... 65443 files and directories currently installed.)
google_compute_instance.default (remote-exec): Preparing to unpack .../azcmagent_1.34.02440.1130_amd64.deb ...
Progress: [  0%]nstance.default (remote-exec): 
Progress: [ 20%] [###...............] e-exec): Preinstall...install] 
google_compute_instance.default (remote-exec): Creating himds group ...
google_compute_instance.default (remote-exec): Creating himds account ...
google_compute_instance.default (remote-exec): Unpacking azcmagent (1.34.02440.1130) ...
google_compute_instance.default: Still creating... [1m40s elapsed]
Progress: [ 40%] [#######...........] e-exec): Setting up azcmagent (1.34.02440.1130) ...
Progress: [ 60%] [##########........] e-exec): Postinstall...configure
google_compute_instance.default (remote-exec): Creating new /var/opt/azcmagent/agentconfig.json
google_compute_instance.default (remote-exec): Creating new /etc/cron.d/azcmagent_autoupgrade
google_compute_instance.default (remote-exec): Netstat not installed.  Skipping IP port checking. The service needs to listen on 40342
google_compute_instance.default (remote-exec): Created symlink /etc/systemd/system/multi-user.target.wants/himdsd.service → /lib/systemd/system/himdsd.service.
google_compute_instance.default (remote-exec): Checked guest config disabled: 0
google_compute_instance.default (remote-exec): Checked ext service disabled: 0
google_compute_instance.default (remote-exec): Getting status via systemd
google_compute_instance.default (remote-exec): Arc GC service is not running.
google_compute_instance.default (remote-exec): Configuring Arc GC service ...
google_compute_instance.default (remote-exec): Found systemd service controller...for Arc GC Service

google_compute_instance.default (remote-exec): Created symlink /etc/systemd/system/multi-user.target.wants/gcad.service → /lib/systemd/system/gcad.service.
google_compute_instance.default (remote-exec): Service configured through systemd service controller. Gc Service
google_compute_instance.default (remote-exec): Enabling gcad
google_compute_instance.default (remote-exec): Getting status via systemd
google_compute_instance.default (remote-exec): Arc GC service is not running.
google_compute_instance.default (remote-exec): STARTING Arc GC
google_compute_instance.default (remote-exec): Getting status via systemd
google_compute_instance.default (remote-exec): EXT service is not running.
google_compute_instance.default (remote-exec): Configuring EXT service ...
google_compute_instance.default (remote-exec): Found systemd service controller...for Extension Service
google_compute_instance.default (remote-exec): Created symlink /etc/systemd/system/multi-user.target.wants/extd.service → /lib/systemd/system/extd.service.
google_compute_instance.default (remote-exec): Service configured through systemd service controller. Extension Service
google_compute_instance.default (remote-exec): Enabling extd
google_compute_instance.default (remote-exec): STARTING EXT
Progress: [ 80%] [##############....] e-exec): 

google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [                ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [=               ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [==              ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [===             ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [====            ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [=====           ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [======          ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [=======         ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [========        ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [=========       ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [==========      ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [===========     ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [============    ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [=============   ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [==============  ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [=============== ]
google_compute_instance.default (remote-exec): Scanning processes... [================]
google_compute_instance.default (remote-exec): Scanning processes...
google_compute_instance.default (remote-exec): Scanning linux images... [             ]
google_compute_instance.default (remote-exec): Scanning linux images... [====         ]
google_compute_instance.default (remote-exec): Scanning linux images... [========     ]
google_compute_instance.default (remote-exec): Scanning linux images... [=============]
google_compute_instance.default (remote-exec): Scanning linux images...

google_compute_instance.default (remote-exec): Running kernel seems to be up-to-date.

google_compute_instance.default (remote-exec): No services need to be restarted.

google_compute_instance.default (remote-exec): No containers need to be restarted.

google_compute_instance.default (remote-exec): No user sessions are running outdated
google_compute_instance.default (remote-exec):  binaries.

google_compute_instance.default (remote-exec): No VM guests are running outdated
google_compute_instance.default (remote-exec):  hypervisor (qemu) binaries on this
google_compute_instance.default (remote-exec):  host.
google_compute_instance.default: Still creating... [1m50s elapsed]
google_compute_instance.default (remote-exec): Latest version of azcmagent is installed.
google_compute_instance.default (remote-exec): INFO    Connecting machine to Azure... This might take a few minutes.
google_compute_instance.default (remote-exec): INFO    Testing connectivity to endpoints that are needed to connect to Azure... This might take a few minutes.
google_compute_instance.default (remote-exec):   20% [==>            ]
google_compute_instance.default (remote-exec):   
google_compute_instance.default (remote-exec):   30% [===>           ]
google_compute_instance.default (remote-exec):   INFO    Creating resource in Azure...                 Correlation ID=d009f5dd-dba8-4ac7-bac9-b54ef3a6671a Resource ID=/subscriptions/30ec2138-bada-4436-b82c-7207f1e4ce86/resourceGroups/Arc-GCP-Demo/providers/Microsoft.HybridCompute/machines/arc-gcp-demo
google_compute_instance.default (remote-exec):   60% [========>      ]
google_compute_instance.default (remote-exec):   
google_compute_instance.default (remote-exec):   80% [===========>   ]
google_compute_instance.default (remote-exec):   
google_compute_instance.default (remote-exec):  100% [===============]
google_compute_instance.default (remote-exec):   INFO    Connected machine to Azure
google_compute_instance.default (remote-exec): INFO    Machine overview page: https://portal.azure.com/#@0bed5dca-2730-4b14-a0a0-cbb5096d8484/resource/subscriptions/30ec2138-bada-4436-b82c-7207f1e4ce86/resourceGroups/Arc-GCP-Demo/providers/Microsoft.HybridCompute/machines/arc-gcp-demo/overview
google_compute_instance.default: Still creating... [2m0s elapsed]
google_compute_instance.default: Creation complete after 2m1s [id=projects/azure-arc-397704/zones/us-west1-a/instances/arc-gcp-demo]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

default_account = ""
ip = ""